app/views/atendimentos/search.html.erb

	<div class="row">
		<label class="pull-right" style="margin-right: 2%"><%= Atendimento.count %> atendimentos cadastrados</label>
---
SELECT "atendimentos".* FROM "atendimentos" WHERE (LOWER(title) like '%naya%')  ORDER BY date ASC
SELECT COUNT(*) FROM "atendimentos"