app/controllers/atendimentos_controller.rb

	def search
		if params[:search]
			@atendimentos = Atendimento.search(params[:search]).order("date ASC")
		else
			@atendimentos = Atendimento.all.order('date ASC').limit(100)
---
SELECT "atendimentos".* FROM "atendimentos" WHERE (LOWER(title) like '%naya%')  ORDER BY date ASC
SELECT  "atendimentos".* FROM "atendimentos"  ORDER BY date ASC LIMIT 100

	def index
		if current_user.present?
			@atendimentos = Atendimento.all
---
SELECT "atendimentos".* FROM "atendimentos"

	def create
		@atendimento = Atendimento.new(atendimento_params)

		respond_to do |format|
			if @atendimento.save
---
INSERT INTO "atendimentos" ("date", "title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["date", "2015-03-02 10:00:00.000000"], ["title", "Nayara"], ["description", "Corte"], ["created_at", "2015-03-02 14:44:07.864897"], ["updated_at", "2015-03-02 14:44:07.864897"]]

	def set_atendimento
		@atendimento = Atendimento.find(params[:id])
---
SELECT  "atendimentos".* FROM "atendimentos" WHERE "atendimentos"."id" = $1 LIMIT 1  [["id", 3]]