app/controllers/users_controller.rb

SELECT "users".* FROM "users"  ORDER BY fullname ASC
---
	def index
		@users = User.all.order('fullname ASC')

INSERT INTO "users" ("fullname", "email", "encrypted_password", "admin", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
	def create
		@user = User.new(user_params)
		respond_to do |format|
			if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 3]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 3]]
---
	def destroy
		@user = User.find(params[:id])
		if @user.present?
			@user.destroy